import urllib.request
import re

a = "警方侦破了网安主侦案件850余起，抓获嫌疑人1380余名，侦破公安部部督案件32起，先后打掉“华中帝国”“Hack80网站”“红蓝安全网”“东方联盟”等网络黑客平台8个，破获网络贩毒、网络赌球、网络制假贩假等一批涉网案件。专项行动期间，网安系统围绕云平台、网络直播、移动应用、电子商务等开展专项整治，对互联网企业进行监督检查和行政执法，共依法查处联网单位980余家次，下架移动APP应用3.8万余个，发现并消除各类安全隐患5.9万余件，清理各类违法信息320余万条。特别是对违法信息高发的“虎嗅网”给予停机整顿处罚，对存在违规视频的12家直播网站进行现场检查和约谈，并对相关游戏公司进行自查整改。同时，网安总队与全市党政机关、行业主管部门等300余家重点单位建立网络安全通报机制，对全市2.6万余个网站开展远程检测，发现并预警各类安全隐患5240余个，清除网络木马和恶意程序560余个。¢http://tool.oschina.net/regex/法信13013083990"

# print(re.search('(http|https)://\w*.\w*.\w*/\w*',a))
# print(re.findall('[1][3456]\d{9}',a))
print("^a", "\nabc\neee")
b=re.findall(r"[^\sa]\w+", "\nabc\neee")
print(b)
print(750/24)